kkweipt/nrf52_add_pairing/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


#ifdef _ADD_PAIRING_
uint8_t delete_bond_in_disconnect = 0;
static void advertising_start(bool erase_bonds);
pm_peer_id_t next_peer_id = PM_PEER_ID_INVALID;
pm_peer_id_t app_peer_now_id = PM_PEER_ID_INVALID;
uint8_t new_bonding_flag = 0;

uint8_t app_peer_successfull = 0;

void app_peer_manager_handle(void)
{
	ret_code_t err_code;
	pm_peer_id_t next_peer_id = PM_PEER_ID_INVALID;
	
	
	if(app_peer_successfull == 0)
	{
		return ;
	}

	next_peer_id = pm_next_peer_id_get(app_peer_now_id);
	NRF_LOG_INFO("new peering ,next peer id is %d",next_peer_id);
	if(next_peer_id != PM_PEER_ID_INVALID)
	{
    NRF_LOG_INFO("next peer delete: %d",next_peer_id);
		err_code = pm_peer_delete(next_peer_id);
		if (err_code != NRF_SUCCESS)
		{
				NRF_LOG_INFO("%s() failed because a call to pm_peer_delete() returned %s. peer_id: %d",
											__func__,nrf_strerror_get(err_code),next_peer_id);
				return ;
		}
	}
	else
	{
		if(app_peer_now_id >=  (APP_BONDING_NUM-1))
		{
			NRF_LOG_INFO("Delete the first peer id :0 ");
			err_code = pm_peer_delete(0);
			if (err_code != NRF_SUCCESS)
			{
					NRF_LOG_INFO("%s() failed because a call to pm_peer_delete() returned %s. peer_id: %d",
												__func__,nrf_strerror_get(err_code),next_peer_id);
					return ;
			}
		}
	}
	
	app_peer_successfull = 0;
	NRF_LOG_INFO("app_peer_successfull = %d",app_peer_successfull);
}




/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    uint32_t err_code;
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
                NRF_LOG_INFO("PM_EVT_PEERS_DELETE_SUCCEEDED,connect handle %d",m_conn_handle);
                NRF_LOG_FLUSH();
                sd_ble_gap_disconnect(m_conn_handle,BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//               APP_ERROR_CHECK(err_code);
                if(delete_bond_in_disconnect)
                {
                  sd_ble_gap_adv_stop(m_advertising.adv_handle);
                  advertising_start(false);
                  delete_bond_in_disconnect = 0;
                }
            break;
        
        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            NRF_LOG_INFO("PM_EVT_CONN_SEC_CONFIG_REQ: peer_id=%d, accept to fix bonding",
                           p_evt->peer_id);
            // Accept pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = true};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;
        case PM_EVT_CONN_SEC_FAILED:
        {
            NRF_LOG_INFO("PM_EVT_CONN_SEC_FAILED: peer_id=%d,procedure=%d,error=%d",
            p_evt->peer_id,
            p_evt->params.conn_sec_failed.procedure,
            p_evt->params.conn_sec_failed.error);
//						sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        } break;
        
        case PM_EVT_CONN_SEC_START:
        {
 //         app_peer_now_id = p_evt->peer_id;
 //         NRF_LOG_INFO("PM_EVT_CONN_SEC_START,get peer id: %d",app_peer_now_id);
        
        } break;        
        
       case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        {
            // Note: You should check on what kind of white list policy your application should use.
            app_peer_now_id = p_evt->peer_id;
            NRF_LOG_INFO(",get peer id: %d",app_peer_now_id);
            
            if (     p_evt->params.peer_data_update_succeeded.flash_changed
                 && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING))
            {
                NRF_LOG_DEBUG("New Bond, add the peer to the whitelist if possible");
                NRF_LOG_DEBUG("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
                               m_whitelist_peer_cnt + 1,
                               APP_BONDING_NUM);
                app_peer_successfull = 1;
                if (m_whitelist_peer_cnt < APP_BONDING_NUM)
                {
                    // Bonded to a new peer, add it to the whitelist.
                    m_whitelist_peers[m_whitelist_peer_cnt++] = p_evt->peer_id;

                    // The whitelist has been modified, update it in the Peer Manager.
                    err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                  
                    if(err_code == BLE_ERROR_GAP_DEVICE_IDENTITIES_DUPLICATE)
                    {
                      NRF_LOG_DEBUG("add whitelist err_code=0x%x",err_code);
                      m_whitelist_peer_cnt--;
                      m_whitelist_peers[m_whitelist_peer_cnt] = p_evt->peer_id;
                      err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                      {
                        NRF_LOG_DEBUG("add whitelist again err_code=0x%x",err_code);
                      }
                    }           
                    if (err_code != NRF_ERROR_NOT_SUPPORTED && err_code != BLE_ERROR_GAP_DEVICE_IDENTITIES_DUPLICATE)
                    {
                        APP_ERROR_CHECK(err_code);
                    }

                    err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                    APP_ERROR_CHECK(err_code);
                }
                else
                {   
                  NRF_LOG_INFO("Clean m_whitelist_peer_cnt");                  
                  m_whitelist_peer_cnt = 0;
                  m_whitelist_peers[m_whitelist_peer_cnt] = p_evt->peer_id;
									err_code = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
									if (err_code != NRF_ERROR_NOT_SUPPORTED && err_code != BLE_ERROR_GAP_DEVICE_IDENTITIES_DUPLICATE)
									{
											APP_ERROR_CHECK(err_code);
									}

									err_code = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
									APP_ERROR_CHECK(err_code);
                  m_whitelist_peer_cnt++;
                }
            }
        } break;        
        
        
        
        default:
            break;
    }
}

/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
    ble_gap_sec_params_t sec_param;
    ret_code_t           err_code;

    err_code = pm_init();
    APP_ERROR_CHECK(err_code);

    memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

    // Security parameters to be used for all security procedures.
    sec_param.bond           = SEC_PARAM_BOND;
    sec_param.mitm           = SEC_PARAM_MITM;
    sec_param.lesc           = SEC_PARAM_LESC;
    sec_param.keypress       = SEC_PARAM_KEYPRESS;
    sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
    sec_param.oob            = SEC_PARAM_OOB;
    sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
    sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
    sec_param.kdist_own.enc  = 1;
    sec_param.kdist_own.id   = 1;
    sec_param.kdist_peer.enc = 1;
    sec_param.kdist_peer.id  = 1;

    err_code = pm_sec_params_set(&sec_param);
    APP_ERROR_CHECK(err_code);

    err_code = pm_register(pm_evt_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;

